7767517
226 233
Input                    in0                      0 1 in0
Convolution              conv_48                  1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
ConvolutionDepthWise     convdw_87                1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
BinaryOp                 mul_0                    1 1 2 3 0=2 1=1 2=6.180310e-01
BinaryOp                 add_1                    1 1 3 4 0=0 1=1 2=1.877080e-01
HardSwish                hswish_10                1 1 4 5 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_2                    1 1 5 6 0=2 1=1 2=9.575000e-03
BinaryOp                 add_3                    1 1 6 7 0=0 1=1 2=-4.120000e-04
Convolution              conv_49                  1 1 7 8 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
BinaryOp                 mul_4                    1 1 8 9 0=2 1=1 2=7.344810e-01
BinaryOp                 add_5                    1 1 9 10 0=0 1=1 2=2.425200e-01
HardSwish                hswish_11                1 1 10 11 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_6                    1 1 11 12 0=2 1=1 2=1.978850e-01
BinaryOp                 add_7                    1 1 12 13 0=0 1=1 2=-1.916660e-01
ConvolutionDepthWise     convdw_88                1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
BinaryOp                 mul_8                    1 1 14 15 0=2 1=1 2=5.676940e-01
BinaryOp                 add_9                    1 1 15 16 0=0 1=1 2=2.952560e-01
HardSwish                hswish_12                1 1 16 17 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_10                   1 1 17 18 0=2 1=1 2=1.782150e-01
BinaryOp                 add_11                   1 1 18 19 0=0 1=1 2=1.100000e-05
Convolution              conv_50                  1 1 19 20 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 mul_12                   1 1 20 21 0=2 1=1 2=7.864650e-01
BinaryOp                 add_13                   1 1 21 22 0=0 1=1 2=2.175050e-01
HardSwish                hswish_13                1 1 22 23 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_14                   1 1 23 24 0=2 1=1 2=1.680050e-01
BinaryOp                 add_15                   1 1 24 25 0=0 1=1 2=-3.971750e-01
ConvolutionDepthWise     convdw_89                1 1 25 26 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
BinaryOp                 mul_16                   1 1 26 27 0=2 1=1 2=1.435757e+00
BinaryOp                 add_17                   1 1 27 28 0=0 1=1 2=4.225600e-02
HardSwish                hswish_14                1 1 28 29 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_18                   1 1 29 30 0=2 1=1 2=2.099600e-02
BinaryOp                 add_19                   1 1 30 31 0=0 1=1 2=5.000000e-05
Convolution              conv_51                  1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 mul_20                   1 1 32 33 0=2 1=1 2=8.909110e-01
BinaryOp                 add_21                   1 1 33 34 0=0 1=1 2=1.605090e-01
HardSwish                hswish_15                1 1 34 35 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_22                   1 1 35 36 0=2 1=1 2=1.968400e-01
BinaryOp                 add_23                   1 1 36 37 0=0 1=1 2=-1.249430e-01
ConvolutionDepthWise     convdw_90                1 1 37 38 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=576 7=64
BinaryOp                 mul_24                   1 1 38 39 0=2 1=1 2=5.320390e-01
BinaryOp                 add_25                   1 1 39 40 0=0 1=1 2=3.002570e-01
HardSwish                hswish_16                1 1 40 41 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_26                   1 1 41 42 0=2 1=1 2=4.337400e-02
BinaryOp                 add_27                   1 1 42 43 0=0 1=1 2=4.000000e-06
Convolution              conv_52                  1 1 43 44 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 mul_28                   1 1 44 45 0=2 1=1 2=6.439830e-01
BinaryOp                 add_29                   1 1 45 46 0=0 1=1 2=3.766270e-01
HardSwish                hswish_17                1 1 46 47 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_30                   1 1 47 48 0=2 1=1 2=2.519390e-01
BinaryOp                 add_31                   1 1 48 49 0=0 1=1 2=-3.485000e-01
ConvolutionDepthWise     convdw_91                1 1 49 50 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 mul_32                   1 1 50 51 0=2 1=1 2=1.033355e+00
BinaryOp                 add_33                   1 1 51 52 0=0 1=1 2=1.057970e-01
HardSwish                hswish_18                1 1 52 53 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_34                   1 1 53 54 0=2 1=1 2=4.066200e-02
BinaryOp                 add_35                   1 1 54 55 0=0 1=1 2=-5.000000e-06
Convolution              conv_53                  1 1 55 56 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 mul_36                   1 1 56 57 0=2 1=1 2=7.492140e-01
BinaryOp                 add_37                   1 1 57 58 0=0 1=1 2=1.815010e-01
HardSwish                hswish_19                1 1 58 59 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_38                   1 1 59 60 0=2 1=1 2=3.604540e-01
BinaryOp                 add_39                   1 1 60 61 0=0 1=1 2=-6.972000e-02
ConvolutionDepthWise     convdw_92                1 1 61 62 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
BinaryOp                 mul_40                   1 1 62 63 0=2 1=1 2=4.813730e-01
BinaryOp                 add_41                   1 1 63 64 0=0 1=1 2=2.076100e-01
HardSwish                hswish_20                1 1 64 65 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_42                   1 1 65 66 0=2 1=1 2=5.105300e-02
BinaryOp                 add_43                   1 1 66 67 0=0 1=1 2=1.900000e-05
Convolution              conv_54                  1 1 67 68 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=30720
BinaryOp                 mul_44                   1 1 68 69 0=2 1=1 2=6.509190e-01
BinaryOp                 add_45                   1 1 69 70 0=0 1=1 2=3.392740e-01
HardSwish                hswish_21                1 1 70 71 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_46                   1 1 71 72 0=2 1=1 2=4.049940e-01
BinaryOp                 add_47                   1 1 72 73 0=0 1=1 2=-3.010440e-01
ConvolutionDepthWise     convdw_93                1 1 73 74 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_48                   1 1 74 75 0=2 1=1 2=5.040580e-01
BinaryOp                 add_49                   1 1 75 76 0=0 1=1 2=4.113700e-02
HardSwish                hswish_22                1 1 76 77 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_50                   1 1 77 78 0=2 1=1 2=3.392900e-02
BinaryOp                 add_51                   1 1 78 79 0=0 1=1 2=-8.000000e-06
Convolution              conv_55                  1 1 79 80 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_52                   1 1 80 81 0=2 1=1 2=6.397070e-01
BinaryOp                 add_53                   1 1 81 82 0=0 1=1 2=1.881420e-01
HardSwish                hswish_23                1 1 82 83 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_54                   1 1 83 84 0=2 1=1 2=4.241110e-01
BinaryOp                 add_55                   1 1 84 85 0=0 1=1 2=-2.033110e-01
ConvolutionDepthWise     convdw_94                1 1 85 86 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_56                   1 1 86 87 0=2 1=1 2=3.838560e-01
BinaryOp                 add_57                   1 1 87 88 0=0 1=1 2=-9.412000e-03
HardSwish                hswish_24                1 1 88 89 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_58                   1 1 89 90 0=2 1=1 2=1.994600e-02
BinaryOp                 add_59                   1 1 90 91 0=0 1=1 2=1.360000e-04
Convolution              conv_56                  1 1 91 92 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_60                   1 1 92 93 0=2 1=1 2=6.613100e-01
BinaryOp                 add_61                   1 1 93 94 0=0 1=1 2=-1.774300e-02
HardSwish                hswish_25                1 1 94 95 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_62                   1 1 95 96 0=2 1=1 2=5.870850e-01
BinaryOp                 add_63                   1 1 96 97 0=0 1=1 2=2.649000e-03
ConvolutionDepthWise     convdw_95                1 1 97 98 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_64                   1 1 98 99 0=2 1=1 2=3.187900e-01
BinaryOp                 add_65                   1 1 99 100 0=0 1=1 2=2.957590e-01
HardSwish                hswish_26                1 1 100 101 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_66                   1 1 101 102 0=2 1=1 2=1.846500e-02
BinaryOp                 add_67                   1 1 102 103 0=0 1=1 2=7.600000e-05
Convolution              conv_57                  1 1 103 104 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_68                   1 1 104 105 0=2 1=1 2=6.278050e-01
BinaryOp                 add_69                   1 1 105 106 0=0 1=1 2=-1.414570e-01
HardSwish                hswish_27                1 1 106 107 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_70                   1 1 107 108 0=2 1=1 2=6.332960e-01
BinaryOp                 add_71                   1 1 108 109 0=0 1=1 2=1.472210e-01
ConvolutionDepthWise     convdw_96                1 1 109 110 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_72                   1 1 110 111 0=2 1=1 2=3.164360e-01
BinaryOp                 add_73                   1 1 111 112 0=0 1=1 2=4.053780e-01
HardSwish                hswish_28                1 1 112 113 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_74                   1 1 113 114 0=2 1=1 2=1.949400e-02
BinaryOp                 add_75                   1 1 114 115 0=0 1=1 2=-8.600000e-05
Convolution              conv_58                  1 1 115 116 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_76                   1 1 116 117 0=2 1=1 2=5.471010e-01
BinaryOp                 add_77                   1 1 117 118 0=0 1=1 2=-2.070090e-01
HardSwish                hswish_29                1 1 118 119 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_78                   1 1 119 120 0=2 1=1 2=5.311440e-01
BinaryOp                 add_79                   1 1 120 121 0=0 1=1 2=1.744740e-01
ConvolutionDepthWise     convdw_97                1 1 121 122 0=240 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_80                   1 1 122 123 0=2 1=1 2=8.017080e-01
BinaryOp                 add_81                   1 1 123 124 0=0 1=1 2=3.049100e-01
HardSwish                hswish_30                1 1 124 125 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_82                   1 1 125 126 0=2 1=1 2=1.072294e+00
BinaryOp                 add_83                   1 1 126 127 0=0 1=1 2=-8.932510e-01
Split                    splitncnn_0              1 2 127 128 129
Pooling                  gap_5                    1 1 129 130 0=1 4=1
Convolution              convrelu_0               1 1 130 131 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400 9=1
Convolution              conv_60                  1 1 131 132 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400
HardSigmoid              hsigmoid_8               1 1 132 133 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_82               1 1 133 134 0=1 1=1 2=-1
BinaryOp                 mul_84                   2 1 128 134 135 0=2
Convolution              conv_61                  1 1 135 136 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200
BinaryOp                 mul_85                   1 1 136 137 0=2 1=1 2=5.380700e-01
BinaryOp                 add_86                   1 1 137 138 0=0 1=1 2=-1.013670e-01
HardSwish                hswish_31                1 1 138 139 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_87                   1 1 139 140 0=2 1=1 2=6.667140e-01
BinaryOp                 add_88                   1 1 140 141 0=0 1=1 2=7.154400e-02
ConvolutionDepthWise     convdw_98                1 1 141 142 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
BinaryOp                 mul_89                   1 1 142 143 0=2 1=1 2=1.045205e+00
BinaryOp                 add_90                   1 1 143 144 0=0 1=1 2=4.806100e-02
HardSwish                hswish_32                1 1 144 145 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_91                   1 1 145 146 0=2 1=1 2=1.453150e+00
BinaryOp                 add_92                   1 1 146 147 0=0 1=1 2=-1.499338e+00
Split                    splitncnn_1              1 2 147 148 149
Pooling                  gap_6                    1 1 149 150 0=1 4=1
Convolution              convrelu_1               1 1 150 151 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              conv_63                  1 1 151 152 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
HardSigmoid              hsigmoid_9               1 1 152 153 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_83               1 1 153 154 0=1 1=1 2=-1
BinaryOp                 mul_93                   2 1 148 154 155 0=2
Convolution              conv_64                  1 1 155 156 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
BinaryOp                 mul_94                   1 1 156 157 0=2 1=1 2=6.215370e-01
BinaryOp                 add_95                   1 1 157 158 0=0 1=1 2=-3.341710e-01
HardSwish                hswish_33                1 1 158 159 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_96                   1 1 159 160 0=2 1=1 2=5.932100e-01
BinaryOp                 add_97                   1 1 160 161 0=0 1=1 2=1.839210e-01
ConvolutionDepthWise     convdw_99                1 1 161 162 0=480 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
BinaryOp                 mul_98                   1 1 162 163 0=2 1=1 2=2.832240e-01
BinaryOp                 add_99                   1 1 163 164 0=0 1=1 2=6.253560e-01
HardSwish                hswish_34                1 1 164 165 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_100                  1 1 165 166 0=2 1=1 2=6.914000e-03
BinaryOp                 add_101                  1 1 166 167 0=0 1=1 2=5.590000e-04
Convolution              conv_65                  1 1 167 168 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
BinaryOp                 mul_102                  1 1 168 169 0=2 1=1 2=7.644990e-01
BinaryOp                 add_103                  1 1 169 170 0=0 1=1 2=-2.918760e-01
HardSwish                hswish_35                1 1 170 171 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_104                  1 1 171 172 0=2 1=1 2=4.773520e-01
BinaryOp                 add_105                  1 1 172 173 0=0 1=1 2=1.647950e-01
ConvolutionDepthWise     convdw_100               1 1 173 174 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
BinaryOp                 mul_106                  1 1 174 175 0=2 1=1 2=4.263180e-01
BinaryOp                 add_107                  1 1 175 176 0=0 1=1 2=2.958000e-01
HardSwish                hswish_36                1 1 176 177 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_108                  1 1 177 178 0=2 1=1 2=1.039370e-01
BinaryOp                 add_109                  1 1 178 179 0=0 1=1 2=8.120000e-04
Convolution              conv_66                  1 1 179 180 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
BinaryOp                 mul_110                  1 1 180 181 0=2 1=1 2=2.045544e+00
BinaryOp                 add_111                  1 1 181 182 0=0 1=1 2=-1.738630e-01
HardSwish                hswish_37                1 1 182 183 0=1.666667e-01 1=5.000000e-01
BinaryOp                 mul_112                  1 1 183 184 0=2 1=1 2=3.234408e+00
BinaryOp                 add_113                  1 1 184 185 0=0 1=1 2=-3.545210e-01
Pooling                  avgpool2d_7              1 1 185 186 0=1 1=2 11=3 12=3 13=0 2=2 3=0 5=1 6=0
Split                    splitncnn_2              1 2 186 187 188
Convolution              conv_67                  1 1 188 189 0=60 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=86400
Swish                    silu_40                  1 1 189 190
Convolution              conv_68                  1 1 190 191 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_41                  1 1 191 192
Reshape                  reshape_84               1 1 192 193 0=-1 1=120
Permute                  permute_79               1 1 193 194 0=1
Split                    splitncnn_3              1 2 194 195 196
LayerNorm                ln_72                    1 1 196 197 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_77             1 1 197 198 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_114                  2 1 195 198 199 0=0
Split                    splitncnn_4              1 2 199 200 201
LayerNorm                ln_73                    1 1 201 202 0=120 1=1.000000e-05 2=1
Gemm                     gemm_0                   1 1 202 203 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=240 9=120
Swish                    silu_42                  1 1 203 204
Gemm                     gemm_1                   1 1 204 205 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=120 9=240
BinaryOp                 add_115                  2 1 200 205 206 0=0
Split                    splitncnn_5              1 2 206 207 208
LayerNorm                ln_74                    1 1 208 209 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_78             1 1 209 210 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_116                  2 1 207 210 211 0=0
Split                    splitncnn_6              1 2 211 212 213
LayerNorm                ln_75                    1 1 213 214 0=120 1=1.000000e-05 2=1
Gemm                     gemm_2                   1 1 214 215 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=240 9=120
Swish                    silu_43                  1 1 215 216
Gemm                     gemm_3                   1 1 216 217 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=120 9=240
BinaryOp                 add_117                  2 1 212 217 218 0=0
LayerNorm                ln_76                    1 1 218 219 0=120 1=1.000000e-06 2=1
Reshape                  reshape_85               1 1 219 220 0=120 1=-1 2=1
Permute                  permute_80               1 1 220 221 0=4
Convolution              conv_69                  1 1 221 222 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_44                  1 1 222 223
Concat                   cat_0                    2 1 187 223 224 0=0
Convolution              conv_70                  1 1 224 225 0=60 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=172800
Swish                    silu_45                  1 1 225 226
Convolution              conv_71                  1 1 226 227 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_46                  1 1 227 228
Squeeze                  squeeze_86               1 1 228 229 -23303=1,1
Permute                  permute_81               1 1 229 230 0=1
Gemm                     gemm_4                   1 1 230 231 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=18385 9=120
Softmax                  softmax_47               1 1 231 out0 0=1 1=1
